# GetReinforcementRoundingManager Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..GetReinforcementRoundingManager Method
FabricArea Class See Also
---
Returns an object for managing reinforcement rounding override settings.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FabricRoundingManager GetReinforcementRoundingManager()
```

Visual Basic
---
```text
Public Function GetReinforcementRoundingManager As FabricRoundingManager
```

Visual C++
---
```text
public:
FabricRoundingManager^ GetReinforcementRoundingManager()
```

# ### Return Value
The rounding manager.
# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace